# MEPNetworkSegmentData Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPNetworkSegmentData Constructor
MEPNetworkSegmentData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MEPNetworkSegmentData()()()() | Creates a default segment data object. |
| MEPNetworkSegmentData(MEPNetworkSegmentData) | Creates a new segment data object based on another object. |

# See Also
MEPNetworkSegmentData Class
MEPNetworkSegmentData Members
Autodesk.Revit.DB.Analysis Namespace